#include <iostream>
#include <math.h>

int main()
{
	setlocale(LC_ALL, "Russian");
	float a, b, c, x1, x2, d;
	a = 0;
	b = 0;
	c = 0;
	x1 = 0;
	x2 = 0;
	d = 0;
	std::cout << "Вас приветствует программа по нахождению корня квадратного уравнения. Прошу вас ввести все переменные" << std::endl;
	std::cin >> a;
	std::cout << std::endl;
	std::cin >> b;
	std::cout << std::endl;
	std::cin >> c;
	std::cout << std::endl;
	if (a != 0 && b != 0 && c != 0)
	{
		d = sqrt((b * b) - (4 * a * c));
		if (d > 0)
		{
			x1 = (-b + d) / (2*a);
			x2 = (-b - d) / (2*a);
			std::cout << "Корни вашего уравнения: " << x1 << " " << x2;
		}
		if (d == 0)
		{
			x1 = -b / 2*a;
			std::cout << "Корень вашего уравнения : " << x1;
		}
		if (d < 0)
		{
			std::cout << "Ваше уравнение не имеет корней";
		}
	}
	if (a == 0 && b != 0 && c != 0)
	{
		x1 = -(c / b);
		std::cout<< "Корень вашего уравнения : " << x1;
	}
	if (a != 0 && b == 0 && c != 0)
	{
		if (c <= 0)
		{
			x1 = sqrt(-c);
			x2 = -sqrt(-c);
			std::cout << "Корни вашего уравнения: " << x1 << " " << x2;
		}
		if (c > 0)
		{
			std::cout << "Ваше уравнение не имеет корней";
		}
	}
	if (a != 0 && b != 0 && c == 0)
	{
		x1 = 0;
		x2 = -b;
		std::cout << "Корни вашего уравнения: " << x1 << " " << x2;
	}
	if (a == 0 && b == 0 && c != 0)
	{
		std::cout << "Ваше уравнение может иметь любой корень";
	}
	if (a != 0 && b == 0 && c == 0)
	{
		x1 = 0;
		std::cout << "Корень вашего уравнения : " << x1;
	}
	if (a == 0 && b != 0 && c == 0)
	{
		x1 = 0;
		std::cout << "Корень вашего уравнения : " << x1;
	}
	return(0);
}